hienvuvg/MSP430G2-Launchpad-Basic-Peripherals-Testing/Lcd_16x2/main.c
#include <msp430g2553.h>
#include "Library/LCD_16x2.h"
#include "stdio.h"

#define Clr(A,B) A&=~B;
#define Set(A,B) A|=B;
#define Tog(A,B) A^=B; // Toggle State // Thay doi
#define Rea(A,B) (A&B) == B ? 0:1
#define __IO volatile
#define uint unsigned int

void Delay(volatile unsigned int n);
void Base_Config(void);
void Tim_Config(void);
void GPIO_Config(void);

__IO uint n;
__IO uint x=100;
float y=1.2347;
char s[6];

void main(void)
{
	Base_Config();
	GPIO_Config();
	Set(P1OUT,BIT0);
	Delay(10);
	Clr(P1OUT,BIT0);
	Delay(10);
	LCD_Init();

	LCD_Clear();
	LCD_Home();
	LCD_PrintString("Test LCD_16x2");
	LCD_Goto(2,0);
	LCD_PrintDecimal(x,4);
	LCD_Goto(2,8);
	LCD_PrintFloat(y,5,3);
    while(1);
}

void Base_Config(void){
	WDTCTL = WDTPW | WDTHOLD;    //Stop Watchdog
	BCSCTL1 = CALBC1_1MHZ;       //2 thanh ghi cai dat tan so hoat dong
	DCOCTL = CALDCO_1MHZ;        //1MHz
}


void GPIO_Config(void){
    Clr(P1DIR,BIT3);
    Set(P1REN,BIT3);
}

void Delay(volatile unsigned int n){
	__IO uint m;
	while(n--){
		m = 100;
		while (m--);
	}
}
